アーキテクチャの図をmermaidに変更
